package com.javarush.test.level03.lesson12.home01;

/* Жить хорошо, а хорошо жить еще лучше
Вывести на экран надпись «Жить хорошо, а хорошо жить еще лучше»
*/

public class Solution {
    public static void main(String[] args) {

        for (int i = 0; i < 4; i++) {

        }
        System.out.println("Жить хорошо, а хорошо жить еще лучше");
    }
}
